/*РАБОТА СО СТЕКОМ*/
#include <iostream>
#include <clocale>
using namespace std;
const int maxsize = 100;
// функция для добавления элемента в стек
void push(int A[], int &top, int element) {
	if (top <= maxsize){
	A[top] = element;
	top++;
	}
}
// функция для удаления элемента из стека
void pop(int A[], int &top) {//только не УДАЛЕНИЯ, а ОБРАБОТКИ!!!! Она должна возвращать элемент из вершины!!!!
	if (top > 0)
		top--;
	else 
		cout << "Невозможно удалить элемент, так как стек пуст!" << "\n";
}
// функция для вывода вершины стека
void view(int A[], int top) {
	cout << "Вершина стека: " << A[top-1] << "\n";
}
int main() {
	setlocale(LC_ALL, "Russian");
	int A[maxsize];
	int top=0, element;
	cout << "Введите число" << "\n";
	cin >> element;
	push(A, top, element);//Ввести число с кливиатуры. Поместить его в стек (push).
	cout << "Введите число" << "\n";
	cin >> element;
	push(A, top, element);//Ввести число с кливиатуры. Поместить его в стек (push).
	cout << "Введите число" << "\n";
	cin >> element;
	push(A, top, element);//Ввести число с кливиатуры. Поместить его в стек (push).
	view(A, top);//Распечатать вершину стека (view).
	cout << "Количество элементов в стеке: " << top << "\n";//Распечатать кол-во элементов в стеке.
	pop(A, top);//Достать элемент из стека (pop).
	cout << "Новое количество элементов в стеке: " << top << "\n";//Распечатать новое кол-во элементов в стеке.
	pop(A, top);//Достать элемент из стека (pop). 
	cout << "Элемент, который мы достали из стека: " << A[top] << "\n";//Вывести его на экран
	cout << "Новое количество элементов в стеке: " << top << "\n";//Распечатать новое кол-во элементов в стеке.
	pop(A, top);//Достать элемент из стека (pop).
	cout << "Элемент, который мы достали из стека: " << A[top] << "\n";//Вывести его на экран
	cout << "Количество элементов в стеке: " << top << "\n";//Распечатать новое кол-во элементов в стеке.
	pop(A, top);//Попробовать достать элемент из стека (pop). Вывести предупреждение.
	cout << "Введите число" << "\n"; 
	cin >> element; //Ввести число с кливиатуры
	push(A, top, element);// Поместить его в стек (push).
	cout << "Количество элементов в стеке: " << top << "\n"; //Распечатать новое кол-во элементов в стеке.
}
