/*В программе объявлен массив А целых чисел (размер массива 100). Пользователь вводит число реально используемой части массива 
(число N). Эта часть затем заполняется случайными числами. Потом распечатываем массив. Затем удаляем первый элемент массива 
(сдвигая остальные элементы) и меняем N на единицу. Потом пользователь вводит произвольное число и оно добавляется в конец используемой части 
массива и меняем N на единицу. Потом распечатываем массив. Затем опять удаляем первый элемент массива (сдвигая остальные элементы) и 
меняем N на единицу. Потом пользователь вводит произвольное число и 
оно добавляется в конец используемой части массива и меняем N на единицу. Потом распечатываем массив.*/
#include <iostream>
#include <clocale>
using std::cin;
using std::cout;
void mas(int A[], int N) {
	for (int i=0; i<N; i++){
		A[i]=rand()%100-50;
	}
}

void output(int A[], int N){
	for (int i=0; i<N; i++){
		cout << A[i] << "\n";
	}
	cout << "\n";
}

void del_first(int A[], int &N){
	for (int i=0; i<N; i++){
		A[i-1]=A[i];
	}
	N=N-1;
}

void add_last(int A[], int &N){
	int num;
	cout << "Введите число, которое нужно добавить в конец " << "\n";
	cin >> num;
	cout << "\n";
	N=N+1;
	for (int i=0; i<N; i++){
		A[N-1]=num;
	}
}

int main() {
	setlocale(LC_ALL, "Russian");
	int const  M=100;
	int N, A[M];
	cout << "Введите количество эллементом массива (!до 100) " << "\n";
	cin >> N;
		mas(A, N);/*заполнение случайными числами*/
		output(A, N);/*распечатываем массив*/

		del_first(A, N);/*удаляем первый элемент массива (сдвигая остальные элементы) и меняем N на единицу*/
		output(A, N);/*распечатываем массив*/

		add_last(A, N);/*ользователь вводит произвольное число и оно добавляется в конец используемой части массива и меняем N на единицу*/
		output(A, N);/*распечатываем массив*/

		del_first(A, N);/*опять удаляем первый элемент массива (сдвигая остальные элементы) и меняем N на единицу. Потом пользователь 
						вводит произвольное число и оно добавляется в конец используемой части массива и меняем N на единицу.*/
		add_last(A, N);
		output(A, N);/*распечатываем массив*/
	
}